Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/svd/PIC32CZ2051CA80208.svd
            <register>
               <name>MAN</name>
               <description>PHY Maintenance Register</description>
               <addressOffset>0x1034</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>PHY Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>WTN</name>
                     <description>Write Ten</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>REGA</name>
                     <description>Register Address</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>PHYA</name>
                     <description>PHY Address</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>OP</name>
                     <description>Operation</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CLTTO</name>
                     <description>Clause 22 Operation</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WZO</name>
                     <description>Write ZERO</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RPQ</name>
               <description>Received Pause Quantum Register</description>
               <addressOffset>0x1038</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RPQ</name>
                     <description>Received Pause Quantum</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TPQ</name>
               <description>Transmit Pause Quantum Register</description>
               <addressOffset>0x103C</addressOffset>
               <size>32</size>
               <resetValue>0x0000FFFF</resetValue>
               <fields>
                  <field>
                     <name>TPQ</name>
                     <description>Transmit Pause Quantum</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>TPQP1</name>
                     <description>Transmit Pause Quantum</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TPSF</name>
               <description>TX partial store and forward Register</description>
               <addressOffset>0x1040</addressOffset>
               <size>32</size>
               <resetValue>0x00003FFF</resetValue>
               <fields>
                  <field>
                     <name>TPB1ADR</name>
                     <description>TX packet buffer address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
                  <field>
                     <name>ENTXP</name>
                     <description>Enable TX partial store and forward operation</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RPSF</name>
               <description>RX partial store and forward Register</description>
               <addressOffset>0x1044</addressOffset>
               <size>32</size>
               <resetValue>0x000007FF</resetValue>
               <fields>
                  <field>
                     <name>RPB1ADR</name>
                     <description>RX packet buffer address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>ENRXP</name>
                     <description>Enable RX partial store and forward operation</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RJFML</name>
               <description>RX Jumbo Frame Max Length Register</description>
               <addressOffset>0x1048</addressOffset>
               <size>32</size>
               <resetValue>0x00002800</resetValue>
               <fields>
                  <field>
                     <name>FML</name>
                     <description>Frame Max Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EFIEN</name>
               <description>External FIFO Interface Enable</description>
               <addressOffset>0x104C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EFIEN</name>
                     <description>Enable external fifo interface</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AXIMP</name>
               <description>AXI Max Pipeline</description>
               <addressOffset>0x1054</addressOffset>
               <size>32</size>
               <resetValue>0x00000101</resetValue>
               <fields>
                  <field>
                     <name>AXIMWR</name>
                     <description>AXI Max write requests</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>AXIMRR</name>
                     <description>AXI Max read requests</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RSCCTRL</name>
               <description>Receive side coalescing on queues 1-15 Enable</description>
               <addressOffset>0x1058</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RSCCTRLEN</name>
                     <description>Enables Receive Side Coalescing</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>15</bitWidth>
                  </field>
                  <field>
                     <name>RSCCTRLMSK</name>
                     <description>Mask the clearing of the rsc_en bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTMOD</name>
               <description>Interrupt Moderation</description>
               <addressOffset>0x105C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RXINTMOD</name>
                     <description>RX Interrupt Moderation</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TXINTMOD</name>
                     <description>TX Interrupt Moderation</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSWT</name>
               <description>Sys Wake Time</description>
               <addressOffset>0x1060</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SYSWT</name>
                     <description>Sys Wake Time</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HRB</name>
               <description>Hash Register Bottom [31:0]</description>
               <addressOffset>0x1080</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Hash Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HRT</name>
               <description>Hash Register Top [63:32]</description>
               <addressOffset>0x1084</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Hash Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>4</dim>
               <dimIncrement>0x8</dimIncrement>
               <name>SA[%s]</name>
               <description/>
               <addressOffset>0x1088</addressOffset>
               <register>
                  <name>SAB</name>
                  <description>Specific Address Bottom [31:0] Register</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>ADDR</name>
                        <description>Specific Address 1</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SAT</name>
                  <description>Specific Address Top [47:32] Register</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>ADDR</name>
                        <description>Specific Address 1</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>FLTT</name>
                        <description>Filter type</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FLTBM</name>
                        <description>Filter byte mask</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>STDM[%s]</name>
               <description>Special Type ID Match N Register</description>
               <addressOffset>0x10A8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>STDM</name>
                     <description>Special Type ID Match N</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ENCPY</name>
                     <description>Enable copying of type ID match N matched frames</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WOL</name>
               <description>Wake on LAN</description>
               <addressOffset>0x10B8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IP</name>
                     <description>IP address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>MAG</name>
                     <description>Event enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARP</name>
                     <description>LAN ARP req</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SA1</name>
                     <description>WOL specific address reg 1</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MTI</name>
                     <description>WOL LAN multicast</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPGS</name>
               <description>IPG Stretch Register</description>
               <addressOffset>0x10BC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FL</name>
                     <description>Frame Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SVLAN</name>
               <description>Stacked VLAN Register</description>
               <addressOffset>0x10C0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VLAN_TYPE</name>
                     <description>User Defined VLAN_TYPE Field</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ESVLAN</name>
                     <description>Enable Stacked VLAN Processing Mode</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TPFCP</name>
               <description>Transmit PFC Pause Register</description>
               <addressOffset>0x10C4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PEV</name>
                     <description>Priority Enable Vector</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PQ</name>
                     <description>Pause Quantum</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SAMB1</name>
               <description>Specific Address 1 Mask Bottom [31:0] Register</description>
               <addressOffset>0x10C8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Specific Address 1 Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SAMT1</name>
               <description>Specific Address 1 Mask Top [47:32] Register</description>
               <addressOffset>0x10CC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Specific Address 1 Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMAAM</name>
               <description>Receive DMA Data Buffer Address Mask</description>
               <addressOffset>0x10D0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MEN</name>
                     <description>Mask Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>MVAL</name>
                     <description>Mask Value</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PTPRXUC</name>
               <description>PTP RX unicast IP destination address</description>
               <addressOffset>0x10D4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADD</name>
                     <description>Unicast IP destination address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PTPTXUC</name>
               <description>PTP TX unicast IP destination address</description>
               <addressOffset>0x10D8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADD</name>
                     <description>Unicast IP destination address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NSC</name>
               <description>Tsu timer comparison nanoseconds Register</description>
               <addressOffset>0x10DC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NANOSEC</name>
                     <description>1588 Timer Nanosecond comparison value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>21</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCL</name>
               <description>Tsu timer second comparison Register</description>
               <addressOffset>0x10E0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SEC</name>
                     <description>1588 Timer Second comparison value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCH</name>
               <description>Tsu timer second comparison Register</description>
               <addressOffset>0x10E4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SEC</name>
                     <description>1588 Timer Second comparison value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EFTSH</name>
               <description>PTP Event Frame Transmitted Seconds High Register</description>
               <addressOffset>0x10E8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EFRSH</name>
               <description>PTP Event Frame Received Seconds High Register</description>
               <addressOffset>0x10EC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
